Documents/ВыдачаДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВыдачаДисконтныхКарт</Name>
			<BasedOn>
				<xr:Item>Document.Запрос</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговаяКампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаСделку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгодоприобретатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID_Взаимодействия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДисконтнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыдачаДисконтныхКарт/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.НомерДисконтнойКарты = СтрЗаменить(Объект.НомерДисконтнойКарты, " ", "");
	
	ПараметрыЗаписи.Вставить("ЭтоНовый", Параметры.Ключ.Пустая());
	
	Если Не ЗначениеЗаполнено(Объект.НомерДисконтнойКарты) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер карты", Объект.Ссылка, "НомерДисконтнойКарты", "Объект", Отказ);
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(Объект.МаркетинговаяКампания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана маркетинговая кампания", Объект.Ссылка, "МаркетинговаяКампания", "Объект", Отказ);
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(Объект.ДатаВыдачи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана Дата выдачи", Объект.Ссылка, "ДатаВыдачи", "Объект", Отказ);
	КонецЕсли;			
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Получатель) И (ПараметрыЗаписи.Свойство("ЭтоНовый") И ПараметрыЗаписи.ЭтоНовый) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаСделкуДольщики.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаСделку.Дольщики КАК ЗаявкаНаСделкуДольщики
		|ГДЕ
		|	ЗаявкаНаСделкуДольщики.Клиент = &Клиент
		|	И ЗаявкаНаСделкуДольщики.Реальный";
		
		Запрос.УстановитьПараметр("Клиент", ТекущийОбъект.Получатель);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По клиенту не заключено ни одной сделки, выдать карту невозможно", ТекущийОбъект.Ссылка, "Получатель", "Объект", Отказ);		
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркетинговаяКампанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура("ВыборИзДисконтнойКарты");	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораМК", ЭтотОбъект);
	ОткрытьФорму("Справочник.МаркетинговыеКомпании.Форма.ФормаВыбораМК", ПараметрыОткрытияФормы, ЭтаФорма, , , , ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораМК(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.МаркетинговаяКампания = РезультатЗакрытия.МК;
	
КонецПроцедуры
